In [1]:
import os
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt

In [5]:
data_dir = os.path.abspath("data_fashion/")

# Load data
train_x = pd.read_csv(os.path.join(data_dir, "x_train.csv")).to_numpy()
train_y_df = pd.read_csv(os.path.join(data_dir, "y_train.csv"))

valid_x = pd.read_csv(os.path.join(data_dir, "x_valid.csv")).to_numpy()
valid_y_df = pd.read_csv(os.path.join(data_dir, "y_valid.csv"))

In [6]:
train_y_df, valid_y_df

(     class_name  class_uid
 0      pullover          2
 1           top          0
 2         dress          3
 3        sandal          5
 4      pullover          2
 ...         ...        ...
 2097     sandal          5
 2098     sandal          5
 2099     sandal          5
 2100     sandal          5
 2101     sandal          5

 [2102 rows x 2 columns],
     class_name  class_uid
 0        dress          3
 1        dress          3
 2        dress          3
 3        dress          3
 4        dress          3
 ..         ...        ...
 595    sneaker          7
 596    sneaker          7
 597        top          0
 598        top          0
 599    trouser          1

 [600 rows x 2 columns])

In [14]:
df1 = train_y_df.groupby('class_name')['class_uid'].agg('count').reset_index()

In [15]:
df1

  class_name  class_uid
0      dress        400
1   pullover        100
2     sandal        800
3    sneaker        800
4        top          1
5    trouser          1

In [17]:
df2 = valid_y_df.groupby('class_name')['class_uid'].agg('count').reset_index()

In [18]:
df2

  class_name  class_uid
0      dress        100
1   pullover        100
2     sandal        100
3    sneaker        100
4        top        100
5    trouser        100

In [19]:
train_y_df

     class_name  class_uid
0      pullover          2
1           top          0
2         dress          3
3        sandal          5
4      pullover          2
...         ...        ...
2097     sandal          5
2098     sandal          5
2099     sandal          5
2100     sandal          5
2101     sandal          5

[2102 rows x 2 columns]